Revit 2027 API
CylindricalSurface Methods
The CylindricalSurface type exposes the following members.
Methods
Name | Description
Create |  Construct a cylindrical surface defined by a local coordinate system and a radius.
Dispose
(Inherited from Surface)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetBoundingBoxUV |  Gets the UV bounding box of the surface.
(Inherited from Surface)
GetFrameOfReference |  Returns frame of reference associated with this CylindricalSurface.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsCoincidentWith |  Determine if two surfaces are coincident (ignoring Envelopes). For an affirmative answer, the surfaces must have the same type (e.g., two planes).
(Inherited from Surface)
Project |  Project a 3D point orthogonally onto a surface (to find the nearest point). Throws InvalidOperationException if the projection fails.
(Inherited from Surface)
ProjectWithGuessPoint |  Project a 3D point orthogonally onto a surface (to find the nearest point). This method is meant to be used when a good approximate solution for the projection is available. Throws InvalidOperationException if the projection fails.
(Inherited from Surface)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
CylindricalSurface Class
Autodesk.Revit.DB Namespace